RTP8320/src/Documents/РегистрацияПользователя/РегистрацияПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегистрацияПользователя</name>
  <attributes>
    <name>ФамилияИмяОтчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПользователя</name>
    <type>
      <types>EnumRef.ТипыПользователей</types>
    </type>
  </attributes>
</mdclass:Document>

RTP8320/src/Enums/КвалификацииУдаленныхТестировщиков/КвалификацииУдаленныхТестировщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КвалификацииУдаленныхТестировщиков</name>
  <enumValues>
    <name>Начальный</name>
  </enumValues>
  <enumValues>
    <name>Проверенный</name>
  </enumValues>
  <enumValues>
    <name>Аттестованный</name>
  </enumValues>
  <enumValues>
    <name>Квалифицированный</name>
  </enumValues>
</mdclass:Enum>

RTP8320/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ФамилияИмяОтчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПользователя</name>
    <type>
      <types>EnumRef.ТипыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
</mdclass:Catalog>

RTP8320/src/Catalogs/Заказчики/Заказчики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Заказчики</name>
  <attributes>
    <name>ФамилияИмяОтчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказы</name>
    <type>
      <types>CatalogRef.Заказы</types>
    </type>
  </attributes>
</mdclass:Catalog>

RTP8320/src/Catalogs/Тестировщики/Тестировщики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Тестировщики</name>
  <attributes>
    <name>ФамилияИмяОтчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
</mdclass:Catalog>

RTP8320/src/Documents/РегистрацияПользователя/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ЛогинУникальный() Тогда
		ДобавитьПользователя();
	Иначе
		Сообщить("Пользователь с таким логином уже зарегистрирован.");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЛогинУникальный()
	Результат = Ложь;	
	ТекущийОбъект = ЭтаФорма.Object;
	Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("Логин", ТекущийОбъект.Логин);
	
	Если Пользователь.Пустая() Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ДобавитьПользователя()
	
	ТекущийОбъект = ЭтаФорма.Object;
	Пользователь = Справочники.Пользователи.СоздатьЭлемент();
	Пользователь.Наименование = ТекущийОбъект.Логин;
	Пользователь.Логин = ТекущийОбъект.Логин;
	Пользователь.ФамилияИмяОтчество = ТекущийОбъект.ФамилияИмяОтчество;
	Пользователь.ТипПользователя = ТекущийОбъект.ТипПользователя;
	Пользователь.УникальныйИдентификатор = Новый УникальныйИдентификатор();
	
	Если Пользователь.ТипПользователя = Перечисления.ТипыПользователей.Тестировщик Тогда
		ДобавитьТестировщика(Пользователь);
	ИначеЕсли Пользователь.ТипПользователя = Перечисления.ТипыПользователей.УдаленныйТестировщик Тогда
		ДобавитьУдаленногоТестировщика(Пользователь);
	ИначеЕсли Пользователь.ТипПользователя = Перечисления.ТипыПользователей.Заказчик Тогда
		ДобавитьЗаказчика(Пользователь);
	Иначе
		Сообщить("Не верно указан тип пользователя.");
		Возврат;
	КонецЕсли;
		
	Пользователь.Записать();
	СоздатьПользователя(Пользователь);
	Сообщить("Пользователь добавлен.");
	
КонецПроцедуры

&НаСервере
Процедура СоздатьПользователя(Пользователь)
	НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
	НовыйПользователь.Имя = Пользователь.Логин;
	НовыйПользователь.ПолноеИмя = Пользователь.ФамилияИмяОтчество;
	
	УстановитьРольПользователю(НовыйПользователь, Пользователь.ТипПользователя);
	
	НовыйПользователь.Записать();
КонецПроцедуры

&НаСервере
Процедура УстановитьРольПользователю(Пользователь, ТипПользователя)
	Если ТипПользователя = Перечисления.ТипыПользователей.Заказчик Тогда
		Пользователь.Роли.Добавить(Метаданные.Роли.Заказчик);
	ИначеЕсли ТипПользователя = Перечисления.ТипыПользователей.Тестировщик Тогда
		Пользователь.Роли.Добавить(Метаданные.Роли.Тестировщик);
	ИначеЕсли ТипПользователя = Перечисления.ТипыПользователей.УдаленныйТестировщик Тогда
		Пользователь.Роли.Добавить(Метаданные.Роли.УдаленныйТестировщик);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗаказчика(Пользователь)
	Заказчик = Справочники.Заказчики.СоздатьЭлемент();
	Заказчик.Пользователь = Пользователь.УникальныйИдентификатор;
	Заказчик.ФамилияИмяОтчество = Пользователь.ФамилияИмяОтчество;
	Заказчик.Наименование = Пользователь.ФамилияИмяОтчество;
	
	Попытка
		Заказчик.Записать();
		Сообщить("Заказчик добавлен.")
	Исключение
		Сообщить("Не удалось добавить заказчика!");
	КонецПопытки
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУдаленногоТестировщика(Пользователь)
	УдаленныйТестировщик = Справочники.УдаленныеТестировщики.СоздатьЭлемент();
	УдаленныйТестировщик.Пользователь = Пользователь.УникальныйИдентификатор;
	УдаленныйТестировщик.ФамилияИмяОтчество = Пользователь.ФамилияИмяОтчество;
	УдаленныйТестировщик.Наименование = Пользователь.ФамилияИмяОтчество;
	УдаленныйТестировщик.Квалификация = Перечисления.КвалификацииУдаленныхТестировщиков.Начальный;
	
	Попытка
		УдаленныйТестировщик.Записать();
		Сообщить("Удаленный тестировщик добавлен.")
	Исключение
		Сообщить("Не удалось добавить Удаленного тестировщик!");
	КонецПопытки
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьТестировщика(Пользователь)
	Тестировщик = Справочники.Тестировщики.СоздатьЭлемент();
	Тестировщик.Пользователь = Пользователь.УникальныйИдентификатор;
	Тестировщик.ФамилияИмяОтчество = Пользователь.ФамилияИмяОтчество;
	Тестировщик.Наименование = Пользователь.ФамилияИмяОтчество;
	
	Попытка
		Тестировщик.Записать();
		Сообщить("Тестировщик добавлен.")
	Исключение
		Сообщить("Не удалось добавить тестировщика!");
	КонецПопытки
	
КонецПроцедуры
